m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/hal/src/mcg/fsl_mcg_hal_modes.c
/*
 * Copyright (c) 2013 - 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_mcg_hal_modes.h"
#if FSL_FEATURE_SOC_MCG_COUNT

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*****************************************************************
 * MCG clock mode transition functions
 *
 *   FEI -> FEE
 *   FEI -> FBI
 *   FEI -> FBE
 *
 *   FEE -> FEI
 *   FEE -> FBI
 *   FEE -> FBE
 *
 *   FBI -> FEI
 *   FBI -> FEE
 *   FBI -> FBE
 *   FBI -> BLPI
 *
 *   BLPI -> FBI
 *
 *   FBE -> FEE
 *   FBE -> FEI
 *   FBE -> FBI
 *   FBE -> PBE
 *   FBE -> BLPE
 *
 *   PBE -> FBE
 *   PBE -> PEE
 *   PBE -> BLPE
 *
 *   BLPE -> FBE
 *   BLPE -> PBE
 *
 *   PEE -> PBE
 *
 *****************************************************************/

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_GetMcgMode
 * Description  : This function will check the mcg registers and determine
 * current MCG mode.
 *
 * Return value : mcgMode or error code mcg_modes_t defined in fsl_mcg_hal_modes.h
 *END***********************************************************************************/
mcg_modes_t CLOCK_HAL_GetMcgMode(MCG_Type * base)
{
    mcg_modes_t               mode   = kMcgModeError;
    mcg_clkout_stat_t         clkst  = CLOCK_HAL_GetClkOutStat(base);
    mcg_fll_src_t             irefst = CLOCK_HAL_GetFllSrc(base);
    uint8_t                   lp     = MCG_BRD_C2_LP(base);
#if FSL_FEATURE_MCG_HAS_PLL
    bool                      pllst  = CLOCK_HAL_IsPllSelected(base);
#endif

    /***********************************************************************
                           Mode and Registers
    ____________________________________________________________________

      Mode   |   CLKST    |   IREFST   |   PLLST   |      LP
    ____________________________________________________________________

      FEI    |  00(FLL)   |   1(INT)   |   0(FLL)  |      X
    ____________________________________________________________________

      FEE    |  00(FLL)   |   0(EXT)   |   0(FLL)  |      X
    ____________________________________________________________________

      FBE    |  10(EXT)   |   0(EXT)   |   0(FLL)  |   0(NORMAL)
    ____________________________________________________________________

      FBI    |  01(INT)   |   1(INT)   |   0(FLL)  |   0(NORMAL)
    ____________________________________________________________________

      BLPI   |  01(INT)   |   1(INT)   |   0(FLL)  |   1(LOW POWER)
    ____________________________________________________________________

      BLPE   |  10(EXT)   |   0(EXT)   |     X     |   1(LOW POWER)
    ____________________________________________________________________

      PEE    |  11(PLL)   |   0(EXT)   |   1(PLL)  |      X
    ____________________________________________________________________

      PBE    |  10(EXT)   |   0(EXT)   |   1(PLL)  |   O(NORMAL)
    ____________________________________________________________________

    ***********************************************************************/

    switch (clkst)
    {
        case kMcgClkOutStatFll:
#if FSL_FEATURE_MCG_HAS_PLL
        if (!pllst)
#endif
        {

            if (kMcgFllSrcExternal == irefst)
            {
                mode = kMcgModeFEE;
            }
            else
            {
                mode = kMcgModeFEI;
            }
        }
        break;
        case kMcgClkOutStatInternal:
        if ((kMcgFllSrcInternal == irefst)
#if FSL_FEATURE_MCG_HAS_PLL
            && (!pllst)
#endif
           )
        {
            if (0U == lp)
            {
                mode = kMcgModeFBI;
            }
            else
            {
                mode = kMcgModeBLPI;
            }
        }
        break;
        case kMcgClkOutStatExternal:
        if (kMcgFllSrcExternal == irefst)
        {
            if (0U == lp)
            {
#if FSL_FEATURE_MCG_HAS_PLL
                if (pllst)
                {
                    mode = kMcgModePBE;
                }
                else
#endif
                {
                    mode = kMcgModeFBE;
                }
            }
            else
            {
                mode = kMcgModeBLPE;
            }
        }
        break;
#if FSL_FEATURE_MCG_HAS_PLL
        case kMcgClkOutStatPll:
        if ((kMcgFllSrcExternal == irefst) && pllst)
        {
            mode = kMcgModePEE;
        }
        break;
#endif
        default:
        break;
    }

    return mode;
}   /* CLOCK_HAL_GetMcgMode */

