m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/hal/src/mcg/fsl_mcg_hal_modes.c
/*FUNCTION******************************************************************************
 *
 * Function name : CLOCK_HAL_PrepareOsc
 * Description  : This function selects the OSC as clock source, and wait for it
 * is stable. This is an internal function used for MCG mode switch.
 *
 *END***********************************************************************************/
static void CLOCK_HAL_PrepareOsc(MCG_Type * base, mcg_oscsel_select_t oscselVal)
{
#if FSL_FEATURE_MCG_USE_OSCSEL
    MCG_BWR_C7_OSCSEL(base, oscselVal);
    if (kMcgOscselOsc == oscselVal)
#endif
    {
        if (MCG_BRD_C2_EREFS(base))
        {
            while(!CLOCK_HAL_IsOsc0Stable(base)){}
        }
    }
}

/*FUNCTION******************************************************************************
 *
 * Function name : CLOCK_HAL_SetFeiMode
 * Description  : This function sets MCG to FEI mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetFeiMode(MCG_Type * base,
                              mcg_dco_range_select_t drs,
                              void (* fllStableDelay)(void),
                              uint32_t *outClkFreq)
{
    uint32_t mcgOut;

    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if (!((kMcgModeFBI | kMcgModeFBE | kMcgModeFEE) & (uint32_t)mode))
    {
        return kMcgModeErrModeUnreachable;
    }

    /* Internal slow clock is used for FLL in FEI mode. */
    /* DMX32 is recommended to be 0 in FEI mode. */
    mcgOut = CLOCK_HAL_TestFllFreq(base,
                                   g_slowInternalRefClkFreq,
                                   kMcgDmx32Default,
                                   drs);
    if (0U == mcgOut)
    {
        return kMcgModeErrFllRefRange;
    }

    /* Set DMX32. DMX32 is recommended to be 0 in FEI mode. */
    MCG_BWR_C4_DMX32(base, kMcgDmx32Default);

    /* Set CLKS and IREFS. */
    MCG_WR_C1(base, ((MCG_RD_C1(base) & ~(MCG_C1_CLKS_MASK | MCG_C1_IREFS_MASK)))
                  | (MCG_C1_CLKS(kMcgClkOutSrcOut)  /* CLKS = 0 */
                  | MCG_C1_IREFS(kMcgFllSrcInternal))); /* IREFS = 1 */

    /* Wait and check status. */
    while (CLOCK_HAL_GetFllSrc(base) != kMcgFllSrcInternal) {}

    while (CLOCK_HAL_GetClkOutStat(base) != kMcgClkOutStatFll) {}
    /* Set DRS. */
    MCG_WR_C4_DRST_DRS(base, drs);

    /* Wait for DRS to be set. */
    while (MCG_BRD_C4_DRST_DRS(base) != drs) {}

    /* Wait for FLL stable time. */
    fllStableDelay();

    *outClkFreq = mcgOut;

    return kMcgModeErrNone;
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_SetFeeMode
 * Description  : This function sets MCG to FEE mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetFeeMode(MCG_Type * base,
                              mcg_oscsel_select_t oscselVal,
                              uint8_t frdivVal,
                              mcg_dmx32_select_t dmx32,
                              mcg_dco_range_select_t drs,
                              void (* fllStableDelay)(void),
                              uint32_t *outClkFreq)
{
    uint32_t mcgOut, extFreq;

    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if (!((kMcgModeFBI | kMcgModeFBE | kMcgModeFEI) & (uint32_t)mode))
    {
        return kMcgModeErrModeUnreachable;
    }

    extFreq = CLOCK_HAL_TestOscFreq(base, oscselVal);

    if (0U == extFreq)
    {
        return kMcgModeErrOscFreqRange;
    }

    /* Check whether FRDIV value is OK for current MCG setting. */
    extFreq = CLOCK_HAL_TestFllExternalRefFreq(base,
                                               extFreq,
                                               frdivVal,
                                               (osc_range_t)MCG_BRD_C2_RANGE(base),
                                               oscselVal);
    if ((extFreq < kMcgConstant31250) || (extFreq > kMcgConstant39063))
    {
        return kMcgModeErrFllFrdivRange;
    }

    /* Check resulting FLL frequency  */
    mcgOut = CLOCK_HAL_TestFllFreq(base, extFreq, dmx32, drs);
    if (0U == mcgOut)
    {
        return kMcgModeErrFllRefRange;
    }

    /* Set OSCSEL */
#if FSL_FEATURE_MCG_USE_OSCSEL
    MCG_BWR_C7_OSCSEL(base, oscselVal);
#endif

    /* Set CLKS and IREFS. */
    MCG_WR_C1(base, (MCG_RD_C1(base) & ~(MCG_C1_CLKS_MASK | MCG_C1_FRDIV_MASK | MCG_C1_IREFS_MASK))
                  | (MCG_C1_CLKS(kMcgClkOutSrcOut)  /* CLKS = 0 */
                  | MCG_C1_FRDIV(frdivVal)  /* FRDIV */
                  | MCG_C1_IREFS(kMcgFllSrcExternal))); /* IREFS = 0 */
#if FSL_FEATURE_MCG_USE_OSCSEL
    if (kMcgOscselOsc == oscselVal)
#endif
    {
        if (MCG_BRD_C2_EREFS(base))
        {
            while(!CLOCK_HAL_IsOsc0Stable(base)){}
        }
    }

    /* Wait and check status. */
    while (CLOCK_HAL_GetFllSrc(base) != kMcgFllSrcExternal) {}

    /* Set DRS and DMX32. */
    MCG_WR_C4(base, (MCG_RD_C4(base)
                 & ~(MCG_C4_DMX32_MASK |
                     MCG_C4_DRST_DRS_MASK))
                 |  (MCG_C4_DMX32(dmx32) |
                     MCG_C4_DRST_DRS(drs)));

    /* Wait for DRS to be set. */
    while (MCG_BRD_C4_DRST_DRS(base) != drs) {}

    /* Check MCG_S[CLKST] */
    while (CLOCK_HAL_GetClkOutStat(base) != kMcgClkOutStatFll) {}

    /* Wait for FLL stable time. */
    fllStableDelay();

    *outClkFreq = mcgOut;

    return kMcgModeErrNone;
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_SetFbiMode
 * Description  : This function sets MCG to FBI mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetFbiMode(MCG_Type * base,
                              mcg_dco_range_select_t drs,
                              mcg_irc_mode_t ircSelect,
                              uint8_t fcrdivVal,
                              void (* fllStableDelay)(void),
                              uint32_t *outClkFreq)
{
    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);

    if (!((kMcgModeFEI | kMcgModeFBE | kMcgModeFEE | kMcgModeBLPI) & (uint32_t)mode))
    {
        return kMcgModeErrModeUnreachable;
    }

    /* In FBI and FEI modes, setting C4[DMX32] bit is not recommended. */
    MCG_BWR_C4_DMX32(base, kMcgDmx32Default);

    /* Set CLKS and IREFS. */
    MCG_WR_C1(base, (MCG_RD_C1(base) & ~(MCG_C1_CLKS_MASK | MCG_C1_IREFS_MASK))
                  | (MCG_C1_CLKS(kMcgClkOutSrcInternal)  /* CLKS = 1 */
                  | MCG_C1_IREFS(kMcgFllSrcInternal))); /* IREFS = 1 */

    /* Wait for state change. */
    while (CLOCK_HAL_GetFllSrc(base) != kMcgFllSrcInternal) {}

    if (kMcgIrcFast == ircSelect)
    {
        /* Update FCRDIV if necessary. */
        CLOCK_HAL_UpdateFastClkInternalRefDiv(base, fcrdivVal);
    }
    /* Set LP and IRCS. */
    MCG_WR_C2(base, (MCG_RD_C2(base) & ~(MCG_C2_LP_MASK | MCG_C2_IRCS_MASK))
                                       | MCG_C2_IRCS(ircSelect));

