m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/hal/src/mcg/fsl_mcg_hal_modes.c
    while (CLOCK_HAL_GetInternalRefClkMode(base) != ircSelect){}

    MCG_WR_C4_DRST_DRS(base, drs);

    /* Wait for DRS to be set. */
    while (MCG_BRD_C4_DRST_DRS(base) != drs) {}

    while (CLOCK_HAL_GetClkOutStat(base) != kMcgClkOutStatInternal){}

    /* Wait for FLL stable time. */
    fllStableDelay();

    /* wait until internal reference switches to requested irc. */
    if (ircSelect == kMcgIrcSlow)
    {
        *outClkFreq = g_slowInternalRefClkFreq; /* MCGOUT frequency equals slow IRC frequency */
    }
    else
    {
        *outClkFreq = (g_fastInternalRefClkFreq >> fcrdivVal);
    }

    return kMcgModeErrNone;
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_SetFbeMode
 * Description  : This function sets MCG to FBE mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetFbeMode(MCG_Type * base,
                             mcg_oscsel_select_t oscselVal,
                             uint8_t frdivVal,
                             mcg_dmx32_select_t dmx32,
                             mcg_dco_range_select_t drs,
                             void (* fllStableDelay)(void),
                             uint32_t *outClkFreq)
{
    uint32_t extFreq;

    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if (!((kMcgModeFBI
         | kMcgModeFEI
         | kMcgModeFBE
         | kMcgModeFEE
         | kMcgModeBLPE
#if FSL_FEATURE_MCG_HAS_PLL
         | kMcgModePBE
#endif
          ) & (uint32_t)mode))
    {
        return kMcgModeErrModeUnreachable;
    }

    extFreq = CLOCK_HAL_TestOscFreq(base, oscselVal);

    if (0U == extFreq)
    {
        return kMcgModeErrOscFreqRange;
    }

#if FSL_FEATURE_MCG_HAS_PLL
    /* Set PLLS. */
    MCG_BWR_C6_PLLS(base, 0U);
    while ((CLOCK_HAL_IsPllSelected(base) != false)) {}
#endif

    /* Set LP bit to enable the FLL */
    MCG_BWR_C2_LP(base, 0U);

#if FSL_FEATURE_MCG_USE_OSCSEL
    if (kMcgModeFEE != mode)
    {
        MCG_BWR_C7_OSCSEL(base, oscselVal);
    }
#endif

    /* Set CLKS and IREFS. */
    MCG_WR_C1(base, (MCG_RD_C1(base) & ~(MCG_C1_CLKS_MASK | MCG_C1_FRDIV_MASK | MCG_C1_IREFS_MASK))
                  | (MCG_C1_CLKS(kMcgClkOutSrcExternal)  /* CLKS = 2 */
                  | MCG_C1_FRDIV(frdivVal)            /* FRDIV = frdivVal */
                  | MCG_C1_IREFS(kMcgFllSrcExternal))); /* IREFS = 0 */

    /* Wait for Reference clock Status bit to clear */
    while (kMcgFllSrcExternal != CLOCK_HAL_GetFllSrc(base)) {}

#if FSL_FEATURE_MCG_USE_OSCSEL
    if (kMcgModeFEE == mode)
    {
        MCG_BWR_C7_OSCSEL(base, oscselVal);
    }
    if (kMcgOscselOsc == oscselVal)
#endif
    {
        if (MCG_BRD_C2_EREFS(base))
        {
            while(!CLOCK_HAL_IsOsc0Stable(base)){}
        }
    }

    /* Set DRST_DRS and DMX32. */
    MCG_WR_C4(base, (MCG_RD_C4(base)
                 & ~(MCG_C4_DMX32_MASK |
                     MCG_C4_DRST_DRS_MASK))
                 |  (MCG_C4_DMX32(dmx32) |
                     MCG_C4_DRST_DRS(drs)));

    /* Wait for DRS to be set. */
    while (MCG_BRD_C4_DRST_DRS(base) != drs) {}

    /* Wait for clock status bits to show clock source is ext ref clk */
    while (CLOCK_HAL_GetClkOutStat(base) != kMcgClkOutStatExternal) {}

    /* Wait for fll stable time. */
    fllStableDelay();

    /* MCGOUT frequency equals external clock frequency */
    *outClkFreq = extFreq;

    return kMcgModeErrNone;
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_SetBlpiMode
 * Description  : This function sets MCG to BLPI mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetBlpiMode(MCG_Type * base,
                               uint8_t fcrdivVal,
                               mcg_irc_mode_t ircSelect,
                               uint32_t *outClkFreq)
{
    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if ((kMcgModeFBI != mode))
    {
        return kMcgModeErrModeUnreachable;
    }

    if (kMcgIrcFast == ircSelect)
    {
        /* Update FCRDIV if necessary. */
        CLOCK_HAL_UpdateFastClkInternalRefDiv(base, fcrdivVal);
    }

    /* Set LP ans IRCS. */
    MCG_WR_C2(base, (MCG_RD_C2(base) & ~MCG_C2_IRCS_MASK)
                                       | MCG_C2_IRCS(ircSelect)
                                       | MCG_C2_LP_MASK);

    while (CLOCK_HAL_GetInternalRefClkMode(base) != ircSelect){}

    /* Now in BLPI */
    if (ircSelect == kMcgIrcFast)
    {
        *outClkFreq = (g_fastInternalRefClkFreq >> fcrdivVal);
    }
    else
    {
        *outClkFreq = g_slowInternalRefClkFreq;
    }

    return kMcgModeErrNone;
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_SetBlpeMode
 * Description  : This function sets MCG to BLPE mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetBlpeMode(MCG_Type * base,
                               mcg_oscsel_select_t oscselVal,
                               uint32_t *outClkFreq)
{
    uint32_t extFreq;

    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if (!((kMcgModeFBE
#if FSL_FEATURE_MCG_HAS_PLL
         | kMcgModePBE
#endif
          ) & (uint32_t)mode))
    {
        return kMcgModeErrModeUnreachable;
    }

    /* External OSC must be initialized before this function. */
    extFreq = CLOCK_HAL_TestOscFreq(base, oscselVal);

    if (0U == extFreq)
    {
        return kMcgModeErrOscFreqRange;
    }

    /* Set LP bit to enter BLPE mode. */
    MCG_BWR_C2_LP(base, 1U);

    CLOCK_HAL_PrepareOsc(base, oscselVal);

    *outClkFreq = extFreq;
    return kMcgModeErrNone;
}

#if FSL_FEATURE_MCG_HAS_PLL
/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_SetPbeMode
 * Description  : This function sets MCG to PBE mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetPbeMode(MCG_Type * base,
                              mcg_oscsel_select_t oscselVal,
                              mcg_pll_clk_select_t pllcsSelect,
                              uint8_t prdivVal,
                              uint8_t vdivVal,
                              uint32_t *outClkFreq)
#if FSL_FEATURE_MCG_HAS_PLL1
{
    uint32_t extFreq, pllFreq;

