m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/hal/src/mcg/fsl_mcg_hal_modes.c
    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if (!((kMcgModeFBE |
           kMcgModePEE |
           kMcgModePBE |
           kMcgModeBLPE) & (uint32_t)mode));
    {
        return kMcgModeErrModeUnreachable;
    }

    /* External OSC must be initialized before this function. */
    extFreq = CLOCK_HAL_TestOscFreq(base, oscselVal);

    if (0U == extFreq)
    {
        return kMcgModeErrOscFreqRange;
    }

    if (pllcsSelect == kMcgPllcsSelectPll1)
    {
        pllFreq = CLOCK_HAL_GetPll1RefFreq(base);
    }
    else
    {
        pllFreq = CLOCK_HAL_GetPll0RefFreq(base);
    }

    pllFreq = pllFreq / (prdivVal + FSL_FEATURE_MCG_PLL_PRDIV_BASE);

    if ((pllFreq < FSL_FEATURE_MCG_PLL_REF_MIN) ||
        (pllFreq > FSL_FEATURE_MCG_PLL_REF_MAX))
    {
        return kMcgErrPllPrdivRange;
    }

    /* Set LP bit to enable the PLL */
    MCG_BWR_C2_LP(base, 0U);

    /* Change to use external clock first. */
    MCG_BWR_C1_CLKS(base, kMcgClkOutSrcExternal);

    /* Wait for clock status bits to update */
    while (CLOCK_HAL_GetClkOutStat(base) != kMcgClkOutStatExternal) {}

    CLOCK_HAL_PrepareOsc(base, oscselVal);

    /* Set PLLS to select FLL. */
    MCG_BWR_C6_PLLS(base, 0U);
    // wait for PLLST status bit to clear.
    while ((CLOCK_HAL_IsPllSelected(base) != false)) {}

    /* Set PRDIV and VDIV. */
    if (pllcsSelect == kMcgPllcsSelectPll1)
    {
        MCG_BWR_C11_PLLCLKEN1(base, 0U);
        MCG_WR_C11_PRDIV1(base, prdivVal);
        MCG_WR_C12_VDIV1(base, vdivVal);
    }
    else
    {
        MCG_BWR_C5_PLLCLKEN0(base, 0U);
        MCG_WR_C5_PRDIV0(base, prdivVal);
        MCG_WR_C6_VDIV0(base, vdivVal);
    }

    CLOCK_HAL_SetPllcs(pllcsSelect);
    while (pllcsSelect != CLOCK_HAL_GetPllClkSelStatMode(base)) {}

    /* Set PLLS to select PLL. */
    MCG_BWR_C6_PLLS(base, 1U);
    // wait for PLLST status bit to set
    while ((CLOCK_HAL_IsPllSelected(base) != true)) {}

    /* Check lock. */
    if (pllcsSelect == kMcgPllcsSelectPll1)
    {
        while (!CLOCK_HAL_IsPll1Locked(base)) {}
    }
    else
    {
        while (!CLOCK_HAL_IsPll0Locked(base)) {}
    }

    *outClkFreq = extFreq;
    return kMcgModeErrNone;
}
#else
{
    uint32_t extFreq, pllRefFreq;

    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if (!((kMcgModeFBE | kMcgModePEE | kMcgModeBLPE) & (uint32_t)mode))
    {
        return kMcgModeErrModeUnreachable;
    }

    /* External OSC must be initialized before this function. */
    extFreq = CLOCK_HAL_TestOscFreq(base, oscselVal);

    if (0U == extFreq)
    {
        return kMcgModeErrOscFreqRange;
    }

#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
    /* Set PLLCS to select PLL. */
    CLOCK_HAL_SetPllClkSelMode(base, pllcsSelect);
    while (pllcsSelect != CLOCK_HAL_GetPllClkSelMode(base)) {}

    if (pllcsSelect == kMcgPllClkSelPll0)
    {
#endif    
        /* Check whether PRDIV value is OK. */
        pllRefFreq = extFreq / (prdivVal + FSL_FEATURE_MCG_PLL_PRDIV_BASE);

        if ((pllRefFreq < FSL_FEATURE_MCG_PLL_REF_MIN) ||
            (pllRefFreq > FSL_FEATURE_MCG_PLL_REF_MAX))
        {
            return kMcgModeErrPllPrdivRange;
        }
#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
    }
#endif
    /* Set LP bit to enable the FLL */
    MCG_BWR_C2_LP(base, 0U);

    /* Change to use external clock first. */
    MCG_BWR_C1_CLKS(base, kMcgClkOutSrcExternal);

    /* Wait for clock status bits to update */
    while (CLOCK_HAL_GetClkOutStat(base) != kMcgClkOutStatExternal) {}

    CLOCK_HAL_PrepareOsc(base, oscselVal);

    // Disable PLL first, then configure PLL.
    CLOCK_HAL_SetPll0EnableCmd(base, false);
    MCG_BWR_C6_PLLS(base, 0U);

    // wait for PLLST status bit to clear.
    while ((CLOCK_HAL_IsPllSelected(base) != false)) {}
#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
    if (pllcsSelect == kMcgPllClkSelPll0)
    {
#endif    
        MCG_WR_C5_PRDIV0(base, prdivVal);

        MCG_WR_C6_VDIV0(base, vdivVal);

        // Enable PLL.
        MCG_BWR_C6_PLLS(base, 1U);

        // wait for PLLST status bit to set
        while ((CLOCK_HAL_IsPllSelected(base) != true)) {}

        /* Wait for LOCK bit to set */
        while (!CLOCK_HAL_IsPll0Locked(base)) {}
#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
    }
    else
    {
        // Enable PLL.
        MCG_BWR_C6_PLLS(base, 1U);

        // wait for PLLST status bit to set
        while ((CLOCK_HAL_IsPllSelected(base) != true)) {}
    }
#endif   
    *outClkFreq = extFreq;
    return kMcgModeErrNone;
}
#endif

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_HAL_SetPeeMode
 * Description  : This function sets MCG to PEE mode.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_HAL_SetPeeMode(MCG_Type * base,
                                      uint32_t *outClkFreq)
{
    mcg_modes_t mode = CLOCK_HAL_GetMcgMode(base);
    if (kMcgModePBE != mode)
    {
        return kMcgModeErrModeUnreachable;
    }

    /* Change to use PLL/FLL output clock first. */
    MCG_BWR_C1_CLKS(base, kMcgClkOutSrcOut);

    /* Wait for clock status bits to update */
    while (CLOCK_HAL_GetClkOutStat(base) != kMcgClkOutStatPll) {}

    *outClkFreq = CLOCK_HAL_GetOutClk(base);

    return kMcgModeErrNone;
}

#endif
#endif

